---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.GetRelatedProducts
source: html/fa71bbad-420e-d073-7012-da63f6f4bd3e.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.GetRelatedProducts Method

Gets all products not associated to stories.

## Syntax (C#)
```csharp
public ICollection<IFCAnyHandle> GetRelatedProducts()
```

## Returns
The collection of products.